# Part 3: Exploratory Data Analysis

## Import and Load

In [1]:
%load_ext google.cloud.bigquery

In [2]:
import os
import pandas as pd
from google.cloud import bigquery
import google.auth
from google.cloud import bigquery

In [3]:
os.environ['GOOGLE_APPLICATION_CREDENTIALS'] = 'C:/Users\Asus/Documents/DE-CodingID/aqueous-freedom-398208-cfe0d4e567f2.json'

In [4]:
bigquery_client = bigquery.Client()

## 1. Apakah semua data yang masuk komplit? Semua column/row terisi?

#### Cek column/row 'Customer'

In [14]:
query1 = """
SELECT * from `aqueous-freedom-398208.OFD_Team_1.Customer`
ORDER BY id_customer ASC;
"""

result1 = bigquery_client.query(query1)
df1 = result1.to_dataframe()
df1

    id_customer     name registration_date contact
0             1   Fadhli        2023-11-01    7834
1             2    Ridho        2023-11-02    2956
2             3   Syaikh        2023-11-03    6412
3             4     Fine        2023-11-04    5078
4             5     Dika        2023-11-05    1239
5             6     Beri        2023-11-06    8645
6             7     Budi        2023-11-07    3091
7             8     Badu        2023-11-08    5726
8             9     Coki        2023-11-09    1863
9            10    David        2023-11-10    9542
10           11     Danu        2023-11-11    4276
11           12     Dodi        2023-11-12    5081
12           13     Dedi        2023-11-13    7392
13           14   Endang        2023-11-14    6158
14           15     Eric        2023-11-15    2947
15           16      Eti        2023-11-16    8304
16           17    Fahri        2023-11-17    1625
17           18    Fahmi        2023-11-18    4957
18           19   Farhan        2023-11-19    2316
19           20  Faishal        2023-11-20    9674
20           21   Fauzan        2023-11-21    5409
21           22     Geri        2023-11-22    3816
22           23    Harun        2023-11-23    6942
23           24     Heru        2023-11-24    1785
24           25    Haris        2023-11-25    4632
25           26     Iwan        2023-11-26    8025
26           27     Inul        2023-11-27    5493
27           28     Ivan        2023-11-28    5493
28           29     Jeri        2023-11-29    8274
29           30    Jamal        2023-11-30    6048

In [15]:
df1.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 30 entries, 0 to 29
Data columns (total 4 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   id_customer        30 non-null     Int64
 1   name               30 non-null     object
 2   registration_date  30 non-null     dbdate
 3   contact            30 non-null     object
dtypes: Int64(1), dbdate(1), object(2)
memory usage: 1.1+ KB

#### Cek column/row 'Order'

In [16]:
query2 = """
SELECT * from `aqueous-freedom-398208.OFD_Team_1.Order`
ORDER BY id_order ASC;
"""

result2 = bigquery_client.query(query2)
df2 = result2.to_dataframe()
df2

    id_order  fk_customer_id  order_date  fk_food_id  quantity   status
0          1              14  2023-11-01           4         2   sukses
1          2              12  2023-11-02           7         2   sukses
2          3              26  2023-11-03           2         3   sukses
3          4               7  2023-11-04           7         2  pending
4          5              29  2023-11-05           2         2   sukses
..       ...             ...         ...         ...       ...      ...
87        88              24  2024-01-27           3         2   sukses
88        89               4  2024-01-28           6         2   sukses
89        90              13  2024-01-29           1         1  pending
90        91               7  2024-01-30           3         3  pending
91        92               9  2024-01-31           7         2   sukses

[92 rows x 6 columns]

In [17]:
df2.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 92 entries, 0 to 91
Data columns (total 6 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   id_order        92 non-null     Int64
 1   fk_customer_id  92 non-null     Int64
 2   order_date      92 non-null     dbdate
 3   fk_food_id      92 non-null     Int64
 4   quantity        92 non-null     Int64
 5   status          92 non-null     object
dtypes: Int64(4), dbdate(1), object(1)
memory usage: 4.8+ KB

#### Cek column/row 'Food'

In [19]:
query3 = """
SELECT * from `aqueous-freedom-398208.OFD_Team_1.Food`
ORDER BY id_food ASC;
"""

result3 = bigquery_client.query(query3)
df3 = result3.to_dataframe()
df3

   id_food    food_name  fk_resto_id  price
0        1  Nasi Goreng            1  25000
1        2   Ayam Bakar            1  35000
2        3    Soto Ayam            2  30000
3        4        Bakso            3  18000
4        5   Mie Goreng            4  20000
5        6    Sate Ayam            3  25000
6        7   Pecel Lele            4  18000

In [20]:
df3.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 7 entries, 0 to 6
Data columns (total 4 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   id_food      7 non-null      Int64
 1   food_name    7 non-null      object
 2   fk_resto_id  7 non-null      Int64
 3   price        7 non-null      Int64
dtypes: Int64(3), object(1)
memory usage: 377.0+ bytes

#### Cek column/row 'Restaurant'

In [24]:
query4 = """
SELECT * from `aqueous-freedom-398208.OFD_Team_1.Restaurant`
ORDER BY id_restaurant ASC;
"""

result4 = bigquery_client.query(query4)
df4 = result4.to_dataframe()
df4

   id_restaurant  restaurant_name           city
0              1      Ambar Resto  Jakarta Barat
1              2      Bunda Resto  Jakarta Timur
2              3        Cak Resto       Surabaya
3              4  Mang Asep Resto        Bandung

In [25]:
df4.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4 entries, 0 to 3
Data columns (total 3 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   id_restaurant    4 non-null      Int64
 1   restaurant_name  4 non-null      object
 2   city             4 non-null      object
dtypes: Int64(1), object(2)
memory usage: 232.0+ bytes

## 2. Apakah ada data type yang tidak sesuai?

##### Jawab: tidak ada, semua data telah sesuai plan

## 3. Apakah ada pertanyaan utama tim business development sebelumnya masih bisa terjawab?

##### Jawab: Bisa terjawab dan sudah terjawab semua